# Shell / terminal
brew "starship"
brew "fzf"
brew "lsd"
brew "fd"
brew "ripgrep"
brew "stow"
brew "lazygit"

# Editor
brew "neovim"
brew "node"
brew "lua"
brew "luajit"

# Multiplexer
brew "tmux"

# Languages / DB
brew "python@3.13"
brew "postgresql@15"

# AWS
brew "aws-sam-cli"

# AI
brew "gemini-cli"

# Git
brew "git"

# Fonts
cask "font-jetbrains-mono"

# Terminal emulators
cask "iterm2"
cask "wezterm"

# Window management
cask "amethyst"

# Auth
cask "git-credential-manager"

# Apps
cask "claude-code"
